Repository: engziada/TheZSolutions
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: File not found.
ar: الملف غير موجود.

source: Invalid file access attempt.
ar: محاولة وصول غير صالحة للملف.

source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: Email already registered
ar: البريد الإلكتروني مسجل بالفعل

source: Username already taken
ar: اسم المستخدم مستخدم بالفعل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Registration successful! Please login.
ar: تم التسجيل بنجاح! يرجى تسجيل الدخول.

source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

source: Please fill in all required fields: %s
ar: يرجى ملء جميع الحقول المطلوبة: %s

source: Resume file is required
ar: ملف السيرة الذاتية مطلوب

source: No file selected
ar: لم يتم اختيار ملف

source: Your application has been submitted successfully! We will review it and get back to you soon.
ar: تم تقديم طلبك بنجاح! سنراجعه ونعود إليك قريباً.

source: Your application was received but there was an issue sending the notification. Our team will still contact you soon.
ar: تم استلام طلبك ولكن حدثت مشكلة في إرسال الإشعار. سيتواصل معك فريقنا قريباً.

source: Please upload a valid resume file (PDF, DOC, DOCX)
ar: يرجى تحميل ملف سيرة ذاتية صالح (PDF, DOC, DOCX)

source: An error occurred while submitting your application. Please try again.
ar: حدث خطأ أثناء تقديم طلبك. يرجى المحاولة مرة أخرى.

source: Join Our Development Team
ar: انضم إلى فريق التطوير لدينا

source: No CV file found for this application.
ar: لم يتم العثور على ملف السيرة الذاتية لهذا الطلب.

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Your message has been sent successfully! We will get back to you soon.
ar: تم إرسال رسالتك بنجاح! سنعاود الاتصال بك قريباً.

source: Your message was received but there was an issue sending the notification. Our team will still contact you soon.
ar: تم استلام رسالتك ولكن حدثت مشكلة في إرسال الإشعار. سيتواصل بك فريقنا قريباً.

source: An error occurred while saving your message. Please try again.
ar: حدث خطأ أثناء حفظ رسالتك. يرجى المحاولة مرة أخرى.

source: Email configuration test successful!
ar: تم اختبار إعدادات البريد الإلكتروني بنجاح!

source: Email configuration test failed: %s
ar: فشل اختبار إعدادات البريد الإلكتروني: %s

source: Your project request has been submitted successfully! We will contact you soon.
ar: تم تقديم طلب مشروعك بنجاح! سنتواصل معك قريباً.

source: Your project request was received but there was an issue sending the notification. Our team will still contact you soon.
ar: تم استلام طلب مشروعك ولكن حدثت مشكلة في إرسال الإشعار. سيتواصل معك فريقنا قريباً.

source: An error occurred while submitting your project request. Please try again.
ar: حدث خطأ أثناء تقديم طلب مشروعك. يرجى المحاولة مرة أخرى.

source: Submit Your Project Request
ar: قدم طلب مشروعك

source: Z Solutions - Custom Software Development
ar: Z Solutions - تطوير برمجيات مخصصة

source: Z Solutions - Where Code Meets Custom. Professional software development services including web applications, desktop solutions, and custom software development.
ar: Z Solutions - حيث يلتقي الكود بالتخصيص. خدمات تطوير برمجيات احترافية تشمل تطبيقات الويب وحلول سطح المكتب وتطوير البرمجيات المخصصة.

source: Professional software development services tailored to your business needs
ar: خدمات تطوير برمجيات احترافية مصممة لتلبية احتياجات عملك

source: Professional software development services
ar: خدمات تطوير برمجيات احترافية

source: Home
ar: الرئيسية

source: Services
ar: الخدمات

source: Projects
ar: المشاريع

source: Contact
ar: اتصل بنا

source: Dashboard
ar: لوحة التحكم

source: Logout
ar: تسجيل الخروج

source: Admin
ar: المدير

source: Pending
ar: قيد الانتظار

source: Recent Projects
ar: المشاريع الحديثة

source: Project Type
ar: نوع المشروع

source: Budget Range
ar: نطاق الميزانية

source: Company Name
ar: اسم الشركة

source: Additional Information
ar: معلومات إضافية

source: Personal Information
ar: المعلومات الشخصية

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email Address
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Professional Information
ar: المعلومات المهنية

source: Position Applying For
ar: الوظيفة المتقدم لها

source: Select a position
ar: اختر وظيفة

source: Frontend Developer
ar: مطور واجهات أمامية

source: Backend Developer
ar: مطور خلفي

source: Full Stack Developer
ar: مطور متكامل

source: Mobile Developer
ar: مطور تطبيقات جوال

source: DevOps Engineer
ar: مهندس عمليات التطوير

source: Years of Experience
ar: سنوات الخبرة

source: Select years of experience
ar: اختر سنوات الخبرة

source: 0-2 years
ar: 0-2 سنوات

source: 2-5 years
ar: 2-5 سنوات

source: 5-10 years
ar: 5-10 سنوات

source: 10+ years
ar: أكثر من 10 سنوات

source: e.g., Python, JavaScript, React, Docker...
ar: مثال بايثون جافاسكريبت رياكت دوكر

source: Portfolio URL
ar: رابط معرض الأعمال

source: GitHub Profile
ar: حساب GitHub

source: Documents
ar: المستندات

source: Resume/CV
ar: السيرة الذاتية

source: Accepted formats: PDF, DOC, DOCX (Max 5MB)
ar: الصيغ المقبولة PDF DOC DOCX الحد الأقصى 5 ميجابايت

source: Cover Letter (Optional)
ar: خطاب التقديم اختياري

source: Tell us why you'd be a great fit for our team...
ar: أخبرنا لماذا ستكون إضافة رائعة لفريقنا

source: Optional but recommended
ar: اختياري ولكن موصى به

source: Submit Application
ar: تقديم الطلب

source: Your Vision, Precisely Coded
ar: رؤيتك مبرمجة بدقة

source: Please read carefully before applying
ar: يرجى القراءة بعناية قبل التقديم

source: Projects and Payments
ar: المشاريع والمدفوعات

source: Kindly note that:
ar: يرجى ملاحظة ما يلي

source: You'll be contacted based on project availability and required skill sets.
ar: سيتم الاتصال بك حسب توفر المشاريع والمهارات المطلوبة

source: Submitting an application doesn't guarantee immediate project assignment.
ar: تقديم الطلب لا يضمن تعيين مشروع فوري

source: Project terms will be agreed directly with an HR representative.
ar: سيتم الاتفاق على شروط المشروع مباشرة مع ممثل الموارد البشرية

source: Payment structure: 50%% at project midpoint, 50%% upon completion and client payment.
ar: هيكل الدفع: 50%% عند منتصف المشروع، 50%% عند الإكمال والدفع من العميل

source: No upfront payments will be made for any project.
ar: لن يتم إجراء أي دفعات مقدمة لأي مشروع

source: Payment methods: InstaPay, Vodafone Cash, Bank Transfer, or PayPal.
ar: طرق الدفع انستا باي فودافون كاش تحويل بنكي باي بال

source: You must have the legal right to work as an independent contractor.
ar: يجب أن يكون لديك الحق القانوني للعمل كمتعاقد مستقل

source: General Terms
ar: الشروط العامة

source: By submitting this application, you agree to the following terms:
ar: بتقديم هذا الطلب فإنك توافق على الشروط التالية

source: All information provided in this application must be true and accurate.
ar: يجب أن تكون جميع المعلومات المقدمة في هذا الطلب صحيحة ودقيقة

source: You authorize us to verify any information provided in your application.
ar: أنت تفوضنا للتحقق من أي معلومات مقدمة في طلبك

source: Your personal data will be processed in accordance with our privacy policy.
ar: ستتم معالجة بياناتك الشخصية وفقا لسياسة الخصوصية الخاصة بنا

source: We may retain your application information for future opportunities.
ar: قد نحتفظ بمعلومات طلبك للفرص المستقبلية

source: Any false statements or omissions may result in disqualification.
ar: أي بيانات كاذبة أو إغفالات قد تؤدي إلى الاستبعاد

source: All documents submitted become the property of the company.
ar: جميع المستندات المقدمة تصبح ملكا للشركة

source: Data Protection
ar: حماية البيانات

source: We will:
ar: سنقوم بـ

source: Keep your data secure and confidential
ar: الحفاظ على بياناتك آمنة وسرية

source: Only use your data for recruitment purposes
ar: استخدام بياناتك لأغراض التوظيف فقط

source: Not share your data with third parties without consent
ar: عدم مشاركة بياناتك مع أطراف ثالثة دون موافقة

source: Retain your data for a maximum of 2 years
ar: الاحتفاظ ببياناتك لمدة أقصاها سنتين

source: I have read and accept the terms and conditions
ar: لقد قرأت وأوافق على الشروط والأحكام

source: Continue
ar: متابعة

source: Application Received
ar: تم استلام طلبك

source: Dear %(name)s,
ar: عزيزي/عزيزتي %(name)s،

source: Thank you for applying for the %(position)s position at The Z Solutions.
ar: شكراً لتقديمك على وظيفة %(position)s في شركة The Z Solutions.

source: We have received your application and will review it carefully. Our team will contact you soon regarding the next steps in the application process.
ar: لقد استلمنا طلبك وسنقوم بمراجعته بعناية. سيتواصل معك فريقنا قريباً بخصوص الخطوات التالية في عملية التقديم.

source: If you have any questions in the meantime, please don't hesitate to contact us.
ar: إذا كان لديك أي أسئلة في الوقت الحالي، فلا تتردد في الاتصال بنا.

source: Best regards,
ar: مع أطيب التحيات،

source: The Z Solutions Team
ar: فريق The Z Solutions

source: Dear
ar: عزيزي

source: Thank you for your interest in joining The Z Solutions and for taking the time to apply for the
ar: شكراً لاهتمامك بالانضمام إلى The Z Solutions وعلى الوقت الذي خصصته للتقدم لوظيفة

source: position
ar: وظيفة

source: After careful consideration of your application, we regret to inform you that we have decided to move forward with other candidates whose qualifications more closely match our current needs.
ar: بعد دراسة متأنية لطلبك، نأسف لإبلاغك بأننا قررنا المضي قدماً مع مرشحين آخرين تتناسب مؤهلاتهم بشكل أوثق مع احتياجاتنا الحالية.

source: Please note that this decision does not reflect on your qualifications or experience. We were impressed by many aspects of your profile, and we encourage you to apply for future positions that match your skills and experience.
ar: يرجى ملاحظة أن هذا القرار لا يعكس مؤهلاتك أو خبرتك. لقد أعجبنا بالعديد من جوانب ملفك الشخصي، ونشجعك على التقدم للوظائف المستقبلية التي تتناسب مع مهاراتك وخبرتك.

source: We wish you the best in your career search and future endeavors.
ar: نتمنى لك التوفيق في بحثك عن وظيفة ومساعيك المستقبلية.

source: Best regards
ar: مع أطيب التحيات

source: Thank you for your application for the
ar: شكراً لتقديمك على وظيفة

source: position at The Z Solutions. We are pleased to inform you that your application has been shortlisted for the next stage of our recruitment process.
ar: في The Z Solutions. يسرنا إبلاغك بأنه تم اختيار طلبك للمرحلة التالية من عملية التوظيف لدينا.

source: Our HR team will contact you shortly to schedule an interview and provide more details about the next steps. Please ensure your contact information
ar: سيتواصل معك فريق الموارد البشرية قريباً لتحديد موعد المقابلة وتقديم المزيد من التفاصيل حول الخطوات التالية. يرجى التأكد من أن معلومات الاتصال الخاصة بك

source: is up to date.
ar: محدثة.

source: If you have any questions or need to update your contact information, please do not hesitate to reach out to us at
ar: إذا كان لديك أي أسئلة أو تحتاج إلى تحديث معلومات الاتصال الخاصة بك، فلا تتردد في التواصل معنا على

source: We look forward to speaking with you soon!
ar: نتطلع للتحدث معك قريباً!

source: The Z Solutions Recruitment Team
ar: فريق التوظيف في The Z Solutions

source: This is an automated message, please do not reply directly to this email.
ar: هذه رسالة آلية، يرجى عدم الرد على هذا البريد الإلكتروني مباشرة.

source: Project Request Received
ar: تم استلام طلب المشروع

source: Thank you for submitting your project request "%(project)s" to The Z Solutions.
ar: شكراً لتقديم طلب مشروع "%(project)s" إلى The Z Solutions.

source: We have received your project request and will review it carefully. Our team will contact you soon to discuss your project requirements in detail.
ar: لقد استلمنا طلب مشروعك وسنقوم بمراجعته بعناية. سيتواصل معك فريقنا قريباً لمناقشة متطلبات مشروعك بالتفصيل.

source: If you have any questions or would like to provide additional information, please don't hesitate to contact us.
ar: إذا كان لديك أي أسئلة أو ترغب في تقديم معلومات إضافية، فلا تتردد في الاتصال بنا.

source: Why settle for off-the-shelf when you can have tailor-made?
ar: لماذا تقبل بالحلول الجاهزة عندما يمكنك الحصول على حل مخصص

source: Join Our Developers
ar: انضم إلى مطورينا

source: Submit New Project
ar: قدم مشروعاً جديداً

source: Our Services
ar: خدماتنا

source: Web Development
ar: تطوير المواقع

source: Custom web applications tailored to your business needs. Specializing in:
ar: تطبيقات ويب مخصصة مصممة لتلبية احتياجات عملك نتخصص في

source: Flask-based enterprise solutions
ar: حلول المؤسسات المبنية على فلاسك

source: E-commerce platforms
ar: منصات التجارة الإلكترونية

source: Content Management Systems
ar: أنظمة إدارة المحتوى

source: RESTful API Development
ar: تطوير واجهات برمجة التطبيقات

source: Desktop Applications
ar: تطبيقات سطح المكتب

source: Powerful desktop solutions featuring:
ar: حلول سطح المكتب القوية تتميز بـ

source: Cross-platform compatibility
ar: التوافق مع مختلف المنصات

source: Real-time data processing
ar: معالجة البيانات في الوقت الفعلي

source: Custom UI/UX design
ar: تصميم واجهة مستخدم مخصصة

source: Offline functionality
ar: العمل بدون اتصال بالإنترنت

source: Mobile Development
ar: تطوير تطبيقات الجوال

source: Cross-platform mobile solutions with:
ar: حلول الجوال المتعددة المنصات مع

source: Native performance
ar: أداء مماثل للتطبيقات الأصلية

source: Responsive design
ar: تصميم متجاوب

source: Push notifications
ar: إشعارات فورية

source: Offline-first architecture
ar: هيكلة تعمل بدون إنترنت أولا

source: Unified Network Management
ar: إدارة الشبكات الموحدة

source: Enterprise-grade platform for unified telecom network management and monitoring
ar: منصة احترافية لإدارة ومراقبة شبكات الاتصالات الموحدة

source: Enterprise Systems Integration
ar: تكامل أنظمة المؤسسات

source: Seamless integration platform connecting various enterprise systems and databases
ar: منصة تكامل سلسة تربط مختلف أنظمة وقواعد بيانات المؤسسات

source: YourSpace Platform
ar: منصة مساحتك

source: Modern workspace management solution with advanced booking features
ar: حل إدارة مساحات العمل الحديث مع ميزات حجز متقدمة

source: View More Projects
ar: عرض المزيد من المشاريع

source: What Our Clients Say
ar: ماذا يقول عملاؤنا

source: Karim F.
ar: كريم ف

source: Project Owner • 3 years 8 months
ar: مالك مشروع - 3 سنوات و 8 أشهر

source: Ali I.
ar: علي إ

source: Project Owner • 1 year 11 months
ar: مالك مشروع - سنة و 11 شهر

source: Our Team
ar: فريقنا

source: Muhammad Ziada
ar: محمد زيادة

source: Lead Developer
ar: مطور رئيسي

source: Omar Khalil
ar: عمر خليل

source: Frontend Architect
ar: مهندس واجهات أمامية

source: Layla Hassan
ar: ليلى حسن

source: Kareem Mahmoud
ar: كريم محمود

source: UI/UX Designer
ar: مصمم واجهات المستخدم

source: Get in Touch
ar: تواصل معنا

source: Name
ar: الاسم

source: Email
ar: البريد الإلكتروني

source: Subject
ar: الموضوع

source: Message
ar: الرسالة

source: Send Message
ar: إرسال الرسالة

source: Project Overview
ar: نظرة عامة على المشروع

source: Project Name
ar: اسم المشروع

source: Select project type
ar: اختر نوع المشروع

source: Web Application
ar: تطبيق ويب

source: Mobile Application
ar: تطبيق جوال

source: Desktop Application
ar: تطبيق سطح المكتب

source: API Development
ar: تطوير واجهات برمجة التطبيقات

source: Automation Solution
ar: حل أتمتة

source: Other
ar: أخرى

source: Project Description
ar: وصف المشروع

source: Please provide a detailed description of your project...
ar: يرجى تقديم وصف مفصل لمشروعك

source: Project Requirements
ar: متطلبات المشروع

source: Key Features
ar: الميزات الرئيسية

source: List the main features you want in your project...
ar: اذكر الميزات الرئيسية التي تريدها في مشروعك

source: Expected Timeline
ar: الجدول الزمني المتوقع

source: Select timeline
ar: اختر الجدول الزمني

source: 1-3 months
ar: 1-3 أشهر

source: 3-6 months
ar: 3-6 أشهر

source: 6-12 months
ar: 6-12 شهر

source: More than 12 months
ar: أكثر من 12 شهر

source: Select budget range
ar: اختر نطاق الميزانية

source: Project Files
ar: ملفات المشروع

source: Additional Files
ar: ملفات إضافية

source: Upload any relevant files (documentation, mockups, etc.). Accepted formats: PDF, DOC, DOCX, TXT, ZIP, RAR, 7Z (Max 5MB per file)
ar: قم بتحميل أي ملفات ذات صلة وثائق نماذج وغيرها الصيغ المقبولة PDF DOC DOCX TXT ZIP RAR 7Z الحد الأقصى 5 ميجابايت لكل ملف

source: Contact Information
ar: معلومات الاتصال

source: Contact Name
ar: اسم جهة الاتصال

source: Preferred Contact Method
ar: طريقة الاتصال المفضلة

source: Phone
ar: الهاتف

source: Any other details you'd like to share...
ar: أي تفاصيل أخرى ترغب في مشاركتها

source: Submit Project Request
ar: تقديم طلب المشروع

source: Access denied. Developer access only.
ar: تم رفض الوصول. مسموح فقط للمطورين.

source: Access denied. You are not assigned to this project.
ar: تم رفض الوصول. أنت غير معين لهذا المشروع.

source: Project status updated to %(status)s.
ar: تم تحديث حالة المشروع إلى %(status)s.

source: This project is no longer accepting applications.
ar: هذا المشروع لم يعد يقبل الطلبات.

source: You have already applied to this project.
ar: لقد تقدمت بالفعل لهذا المشروع.

source: Application submitted successfully!
ar: تم تقديم الطلب بنجاح!

source: Access denied. Customer access only.
ar: تم رفض الوصول. مسموح فقط للعملاء.

source: Project created successfully!
ar: تم إنشاء المشروع بنجاح!

source: Access denied. This project belongs to another customer.
ar: تم رفض الوصول. هذا المشروع يخص عميلاً آخر.

source: Project updated successfully!
ar: تم تحديث المشروع بنجاح!

source: File uploaded successfully!
ar: تم رفع الملف بنجاح!

source: Invalid file type
ar: نوع الملف غير صالح

source: Welcome to The Z Solutions
ar: مرحباً بك في The Z Solutions

source: New Project: %(title)s
ar: مشروع جديد: %(title)s

source: Project Assignment: %(title)s
ar: تعيين مشروع: %(title)s

source: Project Status Update: %(title)s
ar: تحديث حالة المشروع: %(title)s

source: Milestone Completed: %(title)s
ar: تم إكمال المعلم: %(title)s

source: Payment Confirmation
ar: تأكيد الدفع

source: Payment Received
ar: تم استلام الدفع

source: Project Completed: %(title)s
ar: تم إكمال المشروع: %(title)s

source: Update Regarding Your Project Request
ar: تحديث بخصوص طلب مشروعك

source: Your Project Request Has Been Approved!
ar: تمت الموافقة على طلب مشروعك!

source: Update on Your Application - The Z Solutions
ar: تحديث بخصوص طلبك - The Z Solutions

source: Your Application Has Been Shortlisted - The Z Solutions
ar: تم اختيار طلبك للقائمة المختصرة - The Z Solutions
